print ("hello world!")
print ("hello world!")  
print ("hello world!")  
print('hello everyone!')  
print('hello all!')  
print(((((("Don't touch this file!" + "!!!")))))) #(and this string!!!)  
print("Hello everybody")  

#                                                                                                                                                              ____
#                                                                \/                                                                _____                      |    |_
#           /\           |    |    _____      _______  _____   |   /|  ________ |   /|         /\    |   /|      ________  _____  |       _____           /\        |
#          /  \          |____|   |           |     | |     |  |  / |     |     |  / |        /  \   |  / |         |     |       |____  |               /  \      _|
#         /----\         |    |   |-----      |     | |     |  | /  |     |     | /  |       /    \  | /  |         |     |-----  |    | |-----  _      /----\    _|
#        /      \        |    |   |_____      |     | |_____|  |/   |     |     |/   |      /      \ |/   |         |     |_____  |____| |_____ |_|    /      \  |_|
#                                                                                                                                                 |                  
# А если ввести не верное?
int(input(tydfhf))
это же вроде лишь текстовый файл - ничего не будет!
